GopalSaraf/Practicals/PSDL/include/proc/pic16lf19185.inc
// Register: CM2CON0
#define CM2CON0 CM2CON0
CM2CON0                                  equ 0994h
// bitfield definitions
CM2CON0_SYNC_POSN                        equ 0000h
CM2CON0_SYNC_POSITION                    equ 0000h
CM2CON0_SYNC_SIZE                        equ 0001h
CM2CON0_SYNC_LENGTH                      equ 0001h
CM2CON0_SYNC_MASK                        equ 0001h
CM2CON0_HYS_POSN                         equ 0001h
CM2CON0_HYS_POSITION                     equ 0001h
CM2CON0_HYS_SIZE                         equ 0001h
CM2CON0_HYS_LENGTH                       equ 0001h
CM2CON0_HYS_MASK                         equ 0002h
CM2CON0_POL_POSN                         equ 0004h
CM2CON0_POL_POSITION                     equ 0004h
CM2CON0_POL_SIZE                         equ 0001h
CM2CON0_POL_LENGTH                       equ 0001h
CM2CON0_POL_MASK                         equ 0010h
CM2CON0_OUT_POSN                         equ 0006h
CM2CON0_OUT_POSITION                     equ 0006h
CM2CON0_OUT_SIZE                         equ 0001h
CM2CON0_OUT_LENGTH                       equ 0001h
CM2CON0_OUT_MASK                         equ 0040h
CM2CON0_ON_POSN                          equ 0007h
CM2CON0_ON_POSITION                      equ 0007h
CM2CON0_ON_SIZE                          equ 0001h
CM2CON0_ON_LENGTH                        equ 0001h
CM2CON0_ON_MASK                          equ 0080h
CM2CON0_C2SYNC_POSN                      equ 0000h
CM2CON0_C2SYNC_POSITION                  equ 0000h
CM2CON0_C2SYNC_SIZE                      equ 0001h
CM2CON0_C2SYNC_LENGTH                    equ 0001h
CM2CON0_C2SYNC_MASK                      equ 0001h
CM2CON0_C2HYS_POSN                       equ 0001h
CM2CON0_C2HYS_POSITION                   equ 0001h
CM2CON0_C2HYS_SIZE                       equ 0001h
CM2CON0_C2HYS_LENGTH                     equ 0001h
CM2CON0_C2HYS_MASK                       equ 0002h
CM2CON0_C2POL_POSN                       equ 0004h
CM2CON0_C2POL_POSITION                   equ 0004h
CM2CON0_C2POL_SIZE                       equ 0001h
CM2CON0_C2POL_LENGTH                     equ 0001h
CM2CON0_C2POL_MASK                       equ 0010h
CM2CON0_C2OUT_POSN                       equ 0006h
CM2CON0_C2OUT_POSITION                   equ 0006h
CM2CON0_C2OUT_SIZE                       equ 0001h
CM2CON0_C2OUT_LENGTH                     equ 0001h
CM2CON0_C2OUT_MASK                       equ 0040h
CM2CON0_C2ON_POSN                        equ 0007h
CM2CON0_C2ON_POSITION                    equ 0007h
CM2CON0_C2ON_SIZE                        equ 0001h
CM2CON0_C2ON_LENGTH                      equ 0001h
CM2CON0_C2ON_MASK                        equ 0080h

// Register: CM2CON1
#define CM2CON1 CM2CON1
CM2CON1                                  equ 0995h
// bitfield definitions
CM2CON1_INTN_POSN                        equ 0000h
CM2CON1_INTN_POSITION                    equ 0000h
CM2CON1_INTN_SIZE                        equ 0001h
CM2CON1_INTN_LENGTH                      equ 0001h
CM2CON1_INTN_MASK                        equ 0001h
CM2CON1_INTP_POSN                        equ 0001h
CM2CON1_INTP_POSITION                    equ 0001h
CM2CON1_INTP_SIZE                        equ 0001h
CM2CON1_INTP_LENGTH                      equ 0001h
CM2CON1_INTP_MASK                        equ 0002h
CM2CON1_C2INTN_POSN                      equ 0000h
CM2CON1_C2INTN_POSITION                  equ 0000h
CM2CON1_C2INTN_SIZE                      equ 0001h
CM2CON1_C2INTN_LENGTH                    equ 0001h
CM2CON1_C2INTN_MASK                      equ 0001h
CM2CON1_C2INTP_POSN                      equ 0001h
CM2CON1_C2INTP_POSITION                  equ 0001h
CM2CON1_C2INTP_SIZE                      equ 0001h
CM2CON1_C2INTP_LENGTH                    equ 0001h
CM2CON1_C2INTP_MASK                      equ 0002h

// Register: CM2NSEL
#define CM2NSEL CM2NSEL
CM2NSEL                                  equ 0996h
// bitfield definitions
CM2NSEL_NCH_POSN                         equ 0000h
CM2NSEL_NCH_POSITION                     equ 0000h
CM2NSEL_NCH_SIZE                         equ 0003h
CM2NSEL_NCH_LENGTH                       equ 0003h
CM2NSEL_NCH_MASK                         equ 0007h
CM2NSEL_NCH0_POSN                        equ 0000h
CM2NSEL_NCH0_POSITION                    equ 0000h
CM2NSEL_NCH0_SIZE                        equ 0001h
CM2NSEL_NCH0_LENGTH                      equ 0001h
CM2NSEL_NCH0_MASK                        equ 0001h
CM2NSEL_NCH1_POSN                        equ 0001h
CM2NSEL_NCH1_POSITION                    equ 0001h
CM2NSEL_NCH1_SIZE                        equ 0001h
CM2NSEL_NCH1_LENGTH                      equ 0001h
CM2NSEL_NCH1_MASK                        equ 0002h
CM2NSEL_NCH2_POSN                        equ 0002h
CM2NSEL_NCH2_POSITION                    equ 0002h
CM2NSEL_NCH2_SIZE                        equ 0001h
CM2NSEL_NCH2_LENGTH                      equ 0001h
CM2NSEL_NCH2_MASK                        equ 0004h
CM2NSEL_C2NCH_POSN                       equ 0000h
CM2NSEL_C2NCH_POSITION                   equ 0000h
CM2NSEL_C2NCH_SIZE                       equ 0003h
CM2NSEL_C2NCH_LENGTH                     equ 0003h
CM2NSEL_C2NCH_MASK                       equ 0007h
CM2NSEL_C2NCH0_POSN                      equ 0000h
CM2NSEL_C2NCH0_POSITION                  equ 0000h
CM2NSEL_C2NCH0_SIZE                      equ 0001h
CM2NSEL_C2NCH0_LENGTH                    equ 0001h
CM2NSEL_C2NCH0_MASK                      equ 0001h
CM2NSEL_C2NCH1_POSN                      equ 0001h
CM2NSEL_C2NCH1_POSITION                  equ 0001h
CM2NSEL_C2NCH1_SIZE                      equ 0001h
CM2NSEL_C2NCH1_LENGTH                    equ 0001h
CM2NSEL_C2NCH1_MASK                      equ 0002h
CM2NSEL_C2NCH2_POSN                      equ 0002h
CM2NSEL_C2NCH2_POSITION                  equ 0002h
CM2NSEL_C2NCH2_SIZE                      equ 0001h
CM2NSEL_C2NCH2_LENGTH                    equ 0001h
CM2NSEL_C2NCH2_MASK                      equ 0004h

// Register: CM2PSEL
#define CM2PSEL CM2PSEL
CM2PSEL                                  equ 0997h
// bitfield definitions
CM2PSEL_PCH_POSN                         equ 0000h
CM2PSEL_PCH_POSITION                     equ 0000h
CM2PSEL_PCH_SIZE                         equ 0004h
CM2PSEL_PCH_LENGTH                       equ 0004h
CM2PSEL_PCH_MASK                         equ 000Fh
CM2PSEL_PCH0_POSN                        equ 0000h
CM2PSEL_PCH0_POSITION                    equ 0000h
CM2PSEL_PCH0_SIZE                        equ 0001h
CM2PSEL_PCH0_LENGTH                      equ 0001h
CM2PSEL_PCH0_MASK                        equ 0001h
CM2PSEL_PCH1_POSN                        equ 0001h
CM2PSEL_PCH1_POSITION                    equ 0001h
CM2PSEL_PCH1_SIZE                        equ 0001h
CM2PSEL_PCH1_LENGTH                      equ 0001h
CM2PSEL_PCH1_MASK                        equ 0002h
CM2PSEL_PCH2_POSN                        equ 0002h
CM2PSEL_PCH2_POSITION                    equ 0002h
CM2PSEL_PCH2_SIZE                        equ 0001h
CM2PSEL_PCH2_LENGTH                      equ 0001h
CM2PSEL_PCH2_MASK                        equ 0004h
CM2PSEL_C2PCH_POSN                       equ 0000h
CM2PSEL_C2PCH_POSITION                   equ 0000h
CM2PSEL_C2PCH_SIZE                       equ 0004h
CM2PSEL_C2PCH_LENGTH                     equ 0004h
CM2PSEL_C2PCH_MASK                       equ 000Fh
CM2PSEL_C2PCH0_POSN                      equ 0000h
CM2PSEL_C2PCH0_POSITION                  equ 0000h
CM2PSEL_C2PCH0_SIZE                      equ 0001h
CM2PSEL_C2PCH0_LENGTH                    equ 0001h
CM2PSEL_C2PCH0_MASK                      equ 0001h
CM2PSEL_C2PCH1_POSN                      equ 0001h
CM2PSEL_C2PCH1_POSITION                  equ 0001h
CM2PSEL_C2PCH1_SIZE                      equ 0001h
CM2PSEL_C2PCH1_LENGTH                    equ 0001h
CM2PSEL_C2PCH1_MASK                      equ 0002h
CM2PSEL_C2PCH2_POSN                      equ 0002h
CM2PSEL_C2PCH2_POSITION                  equ 0002h
CM2PSEL_C2PCH2_SIZE                      equ 0001h
CM2PSEL_C2PCH2_LENGTH                    equ 0001h
CM2PSEL_C2PCH2_MASK                      equ 0004h

// Register: RC2REG
#define RC2REG RC2REG
RC2REG                                   equ 0A19h
// bitfield definitions
RC2REG_RC2REG_POSN                       equ 0000h
RC2REG_RC2REG_POSITION                   equ 0000h
RC2REG_RC2REG_SIZE                       equ 0008h
RC2REG_RC2REG_LENGTH                     equ 0008h
RC2REG_RC2REG_MASK                       equ 00FFh

