GopalSaraf/Practicals/PSDL/include/proc/pic16lf19185.inc
// Register: ANSELE
#define ANSELE ANSELE
ANSELE                                   equ 01F64h
// bitfield definitions
ANSELE_ANSE0_POSN                        equ 0000h
ANSELE_ANSE0_POSITION                    equ 0000h
ANSELE_ANSE0_SIZE                        equ 0001h
ANSELE_ANSE0_LENGTH                      equ 0001h
ANSELE_ANSE0_MASK                        equ 0001h
ANSELE_ANSE1_POSN                        equ 0001h
ANSELE_ANSE1_POSITION                    equ 0001h
ANSELE_ANSE1_SIZE                        equ 0001h
ANSELE_ANSE1_LENGTH                      equ 0001h
ANSELE_ANSE1_MASK                        equ 0002h
ANSELE_ANSE2_POSN                        equ 0002h
ANSELE_ANSE2_POSITION                    equ 0002h
ANSELE_ANSE2_SIZE                        equ 0001h
ANSELE_ANSE2_LENGTH                      equ 0001h
ANSELE_ANSE2_MASK                        equ 0004h

// Register: WPUE
#define WPUE WPUE
WPUE                                     equ 01F65h
// bitfield definitions
WPUE_WPUE0_POSN                          equ 0000h
WPUE_WPUE0_POSITION                      equ 0000h
WPUE_WPUE0_SIZE                          equ 0001h
WPUE_WPUE0_LENGTH                        equ 0001h
WPUE_WPUE0_MASK                          equ 0001h
WPUE_WPUE1_POSN                          equ 0001h
WPUE_WPUE1_POSITION                      equ 0001h
WPUE_WPUE1_SIZE                          equ 0001h
WPUE_WPUE1_LENGTH                        equ 0001h
WPUE_WPUE1_MASK                          equ 0002h
WPUE_WPUE2_POSN                          equ 0002h
WPUE_WPUE2_POSITION                      equ 0002h
WPUE_WPUE2_SIZE                          equ 0001h
WPUE_WPUE2_LENGTH                        equ 0001h
WPUE_WPUE2_MASK                          equ 0004h
WPUE_WPUE3_POSN                          equ 0003h
WPUE_WPUE3_POSITION                      equ 0003h
WPUE_WPUE3_SIZE                          equ 0001h
WPUE_WPUE3_LENGTH                        equ 0001h
WPUE_WPUE3_MASK                          equ 0008h

// Register: ODCONE
#define ODCONE ODCONE
ODCONE                                   equ 01F66h
// bitfield definitions
ODCONE_ODCE0_POSN                        equ 0000h
ODCONE_ODCE0_POSITION                    equ 0000h
ODCONE_ODCE0_SIZE                        equ 0001h
ODCONE_ODCE0_LENGTH                      equ 0001h
ODCONE_ODCE0_MASK                        equ 0001h
ODCONE_ODCE1_POSN                        equ 0001h
ODCONE_ODCE1_POSITION                    equ 0001h
ODCONE_ODCE1_SIZE                        equ 0001h
ODCONE_ODCE1_LENGTH                      equ 0001h
ODCONE_ODCE1_MASK                        equ 0002h

// Register: SLRCONE
#define SLRCONE SLRCONE
SLRCONE                                  equ 01F67h
// bitfield definitions
SLRCONE_SLRE0_POSN                       equ 0000h
SLRCONE_SLRE0_POSITION                   equ 0000h
SLRCONE_SLRE0_SIZE                       equ 0001h
SLRCONE_SLRE0_LENGTH                     equ 0001h
SLRCONE_SLRE0_MASK                       equ 0001h
SLRCONE_SLRE1_POSN                       equ 0001h
SLRCONE_SLRE1_POSITION                   equ 0001h
SLRCONE_SLRE1_SIZE                       equ 0001h
SLRCONE_SLRE1_LENGTH                     equ 0001h
SLRCONE_SLRE1_MASK                       equ 0002h
SLRCONE_SLRE2_POSN                       equ 0002h
SLRCONE_SLRE2_POSITION                   equ 0002h
SLRCONE_SLRE2_SIZE                       equ 0001h
SLRCONE_SLRE2_LENGTH                     equ 0001h
SLRCONE_SLRE2_MASK                       equ 0004h

// Register: INLVLE
#define INLVLE INLVLE
INLVLE                                   equ 01F68h
// bitfield definitions
INLVLE_INLVLE0_POSN                      equ 0000h
INLVLE_INLVLE0_POSITION                  equ 0000h
INLVLE_INLVLE0_SIZE                      equ 0001h
INLVLE_INLVLE0_LENGTH                    equ 0001h
INLVLE_INLVLE0_MASK                      equ 0001h
INLVLE_INLVLE1_POSN                      equ 0001h
INLVLE_INLVLE1_POSITION                  equ 0001h
INLVLE_INLVLE1_SIZE                      equ 0001h
INLVLE_INLVLE1_LENGTH                    equ 0001h
INLVLE_INLVLE1_MASK                      equ 0002h
INLVLE_INLVLE2_POSN                      equ 0002h
INLVLE_INLVLE2_POSITION                  equ 0002h
INLVLE_INLVLE2_SIZE                      equ 0001h
INLVLE_INLVLE2_LENGTH                    equ 0001h
INLVLE_INLVLE2_MASK                      equ 0004h
INLVLE_INLVLE3_POSN                      equ 0003h
INLVLE_INLVLE3_POSITION                  equ 0003h
INLVLE_INLVLE3_SIZE                      equ 0001h
INLVLE_INLVLE3_LENGTH                    equ 0001h
INLVLE_INLVLE3_MASK                      equ 0008h

// Register: IOCEP
#define IOCEP IOCEP
IOCEP                                    equ 01F69h
// bitfield definitions
IOCEP_IOCEP3_POSN                        equ 0003h
IOCEP_IOCEP3_POSITION                    equ 0003h
IOCEP_IOCEP3_SIZE                        equ 0001h
IOCEP_IOCEP3_LENGTH                      equ 0001h
IOCEP_IOCEP3_MASK                        equ 0008h

// Register: IOCEN
#define IOCEN IOCEN
IOCEN                                    equ 01F6Ah
// bitfield definitions
IOCEN_IOCEN3_POSN                        equ 0003h
IOCEN_IOCEN3_POSITION                    equ 0003h
IOCEN_IOCEN3_SIZE                        equ 0001h
IOCEN_IOCEN3_LENGTH                      equ 0001h
IOCEN_IOCEN3_MASK                        equ 0008h

// Register: IOCEF
#define IOCEF IOCEF
IOCEF                                    equ 01F6Bh
// bitfield definitions
IOCEF_IOCEF3_POSN                        equ 0003h
IOCEF_IOCEF3_POSITION                    equ 0003h
IOCEF_IOCEF3_SIZE                        equ 0001h
IOCEF_IOCEF3_LENGTH                      equ 0001h
IOCEF_IOCEF3_MASK                        equ 0008h

// Register: STATUS_SHAD
#define STATUS_SHAD STATUS_SHAD
STATUS_SHAD                              equ 01FE4h
// bitfield definitions
STATUS_SHAD_C_SHAD_POSN                  equ 0000h
STATUS_SHAD_C_SHAD_POSITION              equ 0000h
STATUS_SHAD_C_SHAD_SIZE                  equ 0001h
STATUS_SHAD_C_SHAD_LENGTH                equ 0001h
STATUS_SHAD_C_SHAD_MASK                  equ 0001h
STATUS_SHAD_DC_SHAD_POSN                 equ 0001h
STATUS_SHAD_DC_SHAD_POSITION             equ 0001h
STATUS_SHAD_DC_SHAD_SIZE                 equ 0001h
STATUS_SHAD_DC_SHAD_LENGTH               equ 0001h
STATUS_SHAD_DC_SHAD_MASK                 equ 0002h
STATUS_SHAD_Z_SHAD_POSN                  equ 0002h
STATUS_SHAD_Z_SHAD_POSITION              equ 0002h
STATUS_SHAD_Z_SHAD_SIZE                  equ 0001h
STATUS_SHAD_Z_SHAD_LENGTH                equ 0001h
STATUS_SHAD_Z_SHAD_MASK                  equ 0004h

// Register: WREG_SHAD
#define WREG_SHAD WREG_SHAD
WREG_SHAD                                equ 01FE5h
// bitfield definitions
WREG_SHAD_WREG_SHAD_POSN                 equ 0000h
WREG_SHAD_WREG_SHAD_POSITION             equ 0000h
WREG_SHAD_WREG_SHAD_SIZE                 equ 0008h
WREG_SHAD_WREG_SHAD_LENGTH               equ 0008h
WREG_SHAD_WREG_SHAD_MASK                 equ 00FFh

// Register: BSR_SHAD
#define BSR_SHAD BSR_SHAD
BSR_SHAD                                 equ 01FE6h
// bitfield definitions
BSR_SHAD_BSR_SHAD_POSN                   equ 0000h
BSR_SHAD_BSR_SHAD_POSITION               equ 0000h
BSR_SHAD_BSR_SHAD_SIZE                   equ 0005h
BSR_SHAD_BSR_SHAD_LENGTH                 equ 0005h
BSR_SHAD_BSR_SHAD_MASK                   equ 001Fh

// Register: PCLATH_SHAD
#define PCLATH_SHAD PCLATH_SHAD
PCLATH_SHAD                              equ 01FE7h
// bitfield definitions
PCLATH_SHAD_PCLATH_SHAD_POSN             equ 0000h
PCLATH_SHAD_PCLATH_SHAD_POSITION         equ 0000h
PCLATH_SHAD_PCLATH_SHAD_SIZE             equ 0007h
PCLATH_SHAD_PCLATH_SHAD_LENGTH           equ 0007h
PCLATH_SHAD_PCLATH_SHAD_MASK             equ 007Fh

// Register: FSR0L_SHAD
#define FSR0L_SHAD FSR0L_SHAD
FSR0L_SHAD                               equ 01FE8h
// bitfield definitions
FSR0L_SHAD_FSR0L_SHAD_POSN               equ 0000h
FSR0L_SHAD_FSR0L_SHAD_POSITION           equ 0000h
FSR0L_SHAD_FSR0L_SHAD_SIZE               equ 0008h
FSR0L_SHAD_FSR0L_SHAD_LENGTH             equ 0008h
FSR0L_SHAD_FSR0L_SHAD_MASK               equ 00FFh

// Register: FSR0H_SHAD
#define FSR0H_SHAD FSR0H_SHAD
FSR0H_SHAD                               equ 01FE9h
// bitfield definitions
FSR0H_SHAD_FSR0H_SHAD_POSN               equ 0000h
FSR0H_SHAD_FSR0H_SHAD_POSITION           equ 0000h
FSR0H_SHAD_FSR0H_SHAD_SIZE               equ 0008h
FSR0H_SHAD_FSR0H_SHAD_LENGTH             equ 0008h
FSR0H_SHAD_FSR0H_SHAD_MASK               equ 00FFh

// Register: FSR1L_SHAD
#define FSR1L_SHAD FSR1L_SHAD
FSR1L_SHAD                               equ 01FEAh
// bitfield definitions
FSR1L_SHAD_FSR1L_SHAD_POSN               equ 0000h
FSR1L_SHAD_FSR1L_SHAD_POSITION           equ 0000h
FSR1L_SHAD_FSR1L_SHAD_SIZE               equ 0008h
FSR1L_SHAD_FSR1L_SHAD_LENGTH             equ 0008h
FSR1L_SHAD_FSR1L_SHAD_MASK               equ 00FFh

// Register: FSR1H_SHAD
#define FSR1H_SHAD FSR1H_SHAD
FSR1H_SHAD                               equ 01FEBh
// bitfield definitions
FSR1H_SHAD_FSR1H_SHAD_POSN               equ 0000h
FSR1H_SHAD_FSR1H_SHAD_POSITION           equ 0000h
FSR1H_SHAD_FSR1H_SHAD_SIZE               equ 0008h
FSR1H_SHAD_FSR1H_SHAD_LENGTH             equ 0008h
FSR1H_SHAD_FSR1H_SHAD_MASK               equ 00FFh

// Register: STKPTR
#define STKPTR STKPTR
STKPTR                                   equ 01FEDh
// bitfield definitions
STKPTR_STKPTR_POSN                       equ 0000h
STKPTR_STKPTR_POSITION                   equ 0000h
STKPTR_STKPTR_SIZE                       equ 0005h
STKPTR_STKPTR_LENGTH                     equ 0005h
STKPTR_STKPTR_MASK                       equ 001Fh

